{
  "name": "Travis Tincher",
  "position": "Full Stack Software Engineer",
  "summary": "I am a software engineer driven by collaboration and curiosity. My focus is on end-to-end full stack feature work. I design, build, and ship well-tested, maintainable features prioritizing the end user experience. As a team member or leader I aim to empower teammates. Fundamentally, every contribution I make is driven by creative innovation.",
  "email": "tincher.travis@gmail.com",
  "phone": "(903) 574-1520",
  "linkedin": "https://www.linkedin.com/in/travis-tincher/",
  "github": "https://github.com/trtincher",
  "experience": [
    {
      "company": "DeepSeas",
      "position": "Software Engineer - Contractor",
      "startDate": "February 2023",
      "endDate": "Present",
      "summary": [
        "Contribute to both Ruby on Rails and NestJS projects at Deep Seas Development, an AWS-focused engineering firm, ensuring performant, scalable, and cost-effective cloud applications.",
        "Lead a collaborative upgrade of a legacy Rails application from Ruby 2/Rails 5 to Ruby 3/Rails 7, enhancing security, maintainability, and alignment with modern industry standards.",
        "Develop and maintain scalable backend services in NestJS using TypeScript and PostgreSQL, ensuring high-quality code and efficient data management across applications."
      ]
    },
    {
      "company": "Alix",
      "position": "Software Engineer - Full-time",
      "startDate": "May 2023",
      "endDate": "December 2024",
      "summary": [
        "Devised an innovative approach to automate sorting of large sets of PDF documents using a combination of AWS S3, AWS Textract, and OpenAI combined with internal business logic exposing the tool through a NodeJS / GraphQL API interface. This reduced the manual processing time by 80%, saving the company an average of 15 hours per client.",
        "Streamlined front-end development and enforced coding standards by creating a reusable custom React component library, automating form UI generation from GraphQL schemas, and integrating Apollo Codegen for Typescript automation, improving code maintainability and reducing new feature development effort by at least 25%.",
        "Collaborated closely with UI/UX Designers to execute streamlined customer facing features in a React client with an emphasis on cross-browser compliant HTML & CSS."
      ]
    },
    {
      "company": "TouchTo",
      "position": "Remote Software Engineer - Contractor",
      "startDate": "February 2023",
      "endDate": "May 2023",
      "summary": [
        "Developed educational web applications for Texas elementary schools using React Native, TypeScript, and GraphQL, including interactive games to teach children about the environment and ecology. Worked closely with accessibility experts for a fully compliant UX experience."
      ]
    },
    {
      "company": "JMJ Financial",
      "position": "Software Engineer II",
      "startDate": "January 2021",
      "endDate": "January 2023",
      "summary": [
        "Developed and implemented a comprehensive backend solution to automate the creation, signing, and management of legally binding documents, integrating APIs for Encompass and HelloSign. Designed data models and state management logic to track document progress, enabling seamless coordination between client systems and loan officers.",
        "Reduced a multi-hour manual document processing workflow into an automated system by building API endpoints, internal Rails-based UI, and webhook listeners to manage document lifecycle events. Improved operational efficiency with only two manual review steps, significantly streamlining both internal and customer-facing processes."
      ]
    },
    {
      "company": "JMJ Financial",
      "position": "Software Engineer I",
      "startDate": "February 2020",
      "endDate": "January 2021",
      "summary": [
        "Created admin forms and views with Ruby on Rails for visualization and maintenance of user data for the purpose of processing home loans.",
        "Built interactive customer forms to create a digital version of the Uniform Residential Loan Application (Form 1003)."
      ]
    },
    {
      "company": "Ctrl Alt Elite",
      "position": "Software Engineering Contractor",
      "startDate": "September 2020",
      "endDate": "February 2021",
      "summary": [
        "Developed an application for a mobile bike mechanic, which included key features such as a Calendly for scheduling, a Google Maps for location mapping."
      ]
    }
  ],
  "education": [
    {
      "institution": "General Assembly",
      "degree": "Software Engineering and Development",
      "startDate": "",
      "endDate": "August 2020",
      "summary": [
        "Earned 1st place in General Assembly’s Alumni Social Impact Hackathon.",
        "Projects:",
        "myBallot WA: Collaborated three UX/UI Designers and four Software Engineers over three days to fully deploy a mobile first React.js responsive web application ballot builder created to simplify and streamline the voting process.",
        "DnD Battle Tracker: A dungeons and dragons full stack application with a PostgresQL db, Ruby on Rails backend, and React.js frontend for maintaining a character and tracking statuses during battle.",
        "Forte: A full stack application with Mongo db, express backend, and React.js to create related teacher and student models with full CRUD functionality.",
        "Brewery mApp: A responsive React.js web application utilizing a third party API to pull brewery information and Mapbox to visualize the visited breweries."
      ]
    },
    {
      "institution": "Emory University",
      "degree": "Master of Theological Studies",
      "startDate": "",
      "endDate": "May 2015"
    },
    {
      "institution": "Texas A&M",
      "degree": "Bachelor of Arts in Philosophy",
      "startDate": "",
      "endDate": "August 2012"
    }
  ],
  "skills": {
    "Languages": [
      "Typescript",
      "Javascript",
      "Ruby",
      "Java",
      "Python"
    ],
    "Backend": [
      "Ruby on Rails",
      "Apollo GraphQL",
      "SQL (Postgres, Active Record)",
      "Data Model & API Design"
    ],
    "Frontend": [
      "ReactJS",
      "React Native",
      "NestJS"
    ],
    "DevOps": [
      "AWS Web Services",
      "Heroku",
      "Docker",
      "CI/CD",
      "Terraform",
      "Firebase"
    ]
  },
  "hobbies": [
    "Songwriting and Playing Guitar",
    "Board Games",
    "Cooking",
    "Reading (Fantasy, SciFi, Manga)",
    "Rock Climbing",
    "Drawing (pen, graphite, colored ink)",
    "Brewing Beer",
    "Dungeons and Dragons"
  ]
}